Nuclei-Software/nuclei-sdk/SoC/gd32vw55x/Common/Include/gd32vw55x_pmu.h
/*!
    \file    gd32vw55x_pmu.h
    \brief   definitions for the PMU

    \version 2023-07-20, V1.0.0, firmware for GD32VW55x
*/

/*
    Copyright (c) 2023, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#ifndef GD32VW55X_PMU_H
#define GD32VW55X_PMU_H

#include "gd32vw55x.h"

/* PMU definitions */
#define PMU                           PMU_BASE                              /*!< PMU base address */

/* registers definitions */
#define PMU_CTL0                      REG32((PMU) + 0x00000000U)            /*!< PMU control register 0 */
#define PMU_CS0                       REG32((PMU) + 0x00000004U)            /*!< PMU control and status register 0 */
#define PMU_CTL1                      REG32((PMU) + 0x00000008U)            /*!< PMU control register 1 */
#define PMU_CS1                       REG32((PMU) + 0x0000000CU)            /*!< PMU control and status register 1 */
#define PMU_PAR0                      REG32((PMU) + 0x00000010U)            /*!< PMU parameter register 0 */
#define PMU_PAR1                      REG32((PMU) + 0x00000014U)            /*!< PMU parameter register 1 */
#define PMU_PAR2                      REG32((PMU) + 0x00000018U)            /*!< PMU parameter register 2 */
#define PMU_RFCTL                     REG32((PMU) + 0x00000020U)            /*!< PMU RF control register */
#define PMU_RFPAR                     REG32((PMU) + 0x00000024U)            /*!< PMU RF timer parameter register */
#define PMU_INTF                      REG32((PMU) + 0x0000002CU)            /*!< PMU BLE interrupt flag register */
#define PMU_INTEN                     REG32((PMU) + 0x00000030U)            /*!< PMU BLE interrupt enable register */
#define PMU_INTC                      REG32((PMU) + 0x00000034U)            /*!< PMU BLE interrupt clear register */

/* bits definitions */
/* PMU_CTL0 */
#define PMU_CTL0_LDOLP                BIT(0)                                /*!< LDO low power mode */
#define PMU_CTL0_STBMOD               BIT(1)                                /*!< standby mode */
#define PMU_CTL0_WURST                BIT(2)                                /*!< wakeup flag reset */
#define PMU_CTL0_STBRST               BIT(3)                                /*!< standby flag reset */
#define PMU_CTL0_LVDEN                BIT(4)                                /*!< low voltage detector enable */
#define PMU_CTL0_LVDT                 BITS(5,7)                             /*!< low voltage detector threshold */
#define PMU_CTL0_BKPWEN               BIT(8)                                /*!< Backup Domain write enable */
#define PMU_CTL0_LDLP                 BIT(10)                               /*!< low-driver mode when use low power LDO */
#define PMU_CTL0_LDNP                 BIT(11)                               /*!< low-driver mode when use normal power LDO */
#define PMU_CTL0_LDEN                 BITS(18,19)                           /*!< low-driver mode enable in deep-sleep mode */

/* PMU_CS0 */
#define PMU_CS0_WUF                   BIT(0)                                /*!< wakeup flag */
#define PMU_CS0_STBF                  BIT(1)                                /*!< standby flag */
#define PMU_CS0_LVDF                  BIT(2)                                /*!< low voltage detector status flag */
#define PMU_CS0_WUPEN0                BIT(8)                                /*!< wakeup pin0 enable */
#define PMU_CS0_WUPEN1                BIT(9)                                /*!< wakeup pin1 enable */
#define PMU_CS0_WUPEN2                BIT(10)                               /*!< wakeup pin2 enable */
#define PMU_CS0_WUPEN3                BIT(11)                               /*!< wakeup pin3 enable */
#define PMU_CS0_LDOVSRF               BIT(14)                               /*!< LDO voltage select ready flag */
#define PMU_CS0_LDRF                  BITS(18,19)                           /*!< low-driver mode ready flag */

/* PMU_CTL1 */
#define PMU_CTL1_WPEN                 BIT(1)                                /*!< enable WIFI power */
#define PMU_CTL1_WPSLEEP              BIT(2)                                /*!< WIFI go to sleep */
#define PMU_CTL1_WPWAKE               BIT(3)                                /*!< wakeup WIFI */
#define PMU_CTL1_SRAM1PSLEEP          BIT(5)                                /*!< SRAM1 go to sleep */
#define PMU_CTL1_SRAM1PWAKE           BIT(6)                                /*!< wakeup SRAM1 */
#define PMU_CTL1_SRAM2PSLEEP          BIT(9)                                /*!< SRAM2 go to sleep */
#define PMU_CTL1_SRAM2PWAKE           BIT(10)                               /*!< wakeup SRAM2 */
#define PMU_CTL1_SRAM3PSLEEP          BIT(13)                               /*!< SRAM3 go to sleep */
#define PMU_CTL1_SRAM3PWAKE           BIT(14)                               /*!< wakeup SRAM3 */
#define PMU_CTL1_RETDIS               BIT(16)                               /*!< no retention register when WIFI power-off */
#define PMU_CTL1_WIFI_LPDS_ON         BIT(17)                               /*!< WIFI auto lpds flow on */
#define PMU_CTL1_WIFI_SRAM_RET        BIT(18)                               /*!< WIFI sram enter retention mode when deepsleep & WIFI sleep */
#define PMU_CTL1_SRAM0PSLEEP          BIT(19)                               /*!< SRAM0 go to sleep */
#define PMU_CTL1_SRAM0PWAKE           BIT(20)                               /*!< wakeup SRAM0 */
#define PMU_CTL1_BLE_SRAM_RET         BIT(21)                               /*!< BLE sram enter retention mode when deepsleep & BLE sleep */
#define PMU_CTL1_BLEPSLEEP            BIT(23)                               /*!< BLE go to sleep */
#define PMU_CTL1_BLEPWAKE             BIT(24)                               /*!< wakeup BLE */
#define PMU_CTL1_BLE_WAKEUP_REQ       BIT(25)                               /*!< BLE wakeup request */

