Nuclei-Software/nuclei-sdk/SoC/gd32vw55x/Common/Include/gd32vw55x_pmu.h
/* PMU_CS1 */
#define PMU_CS1_WPS_SLEEP             BIT(2)                                /*!< WIFI is in sleep state */
#define PMU_CS1_WPS_ACTIVE            BIT(3)                                /*!< WIFI is in active state */
#define PMU_CS1_BLE_POWER_STATE       BIT(4)                                /*!< BLE power status */
#define PMU_CS1_SRAM1PS_SLEEP         BIT(5)                                /*!< SRAM1 is in sleep state */
#define PMU_CS1_SRAM1PS_ACTIVE        BIT(6)                                /*!< SRAM1 is in active state */
#define PMU_CS1_SRAM0PS_SLEEP         BIT(7)                                /*!< SRAM0 is in sleep state */
#define PMU_CS1_SRAM0PS_ACTIVE        BIT(8)                                /*!< SRAM0 is in active state */
#define PMU_CS1_SRAM2PS_SLEEP         BIT(9)                                /*!< SRAM2 is in sleep state */
#define PMU_CS1_SRAM2PS_ACTIVE        BIT(10)                               /*!< SRAM2 is in active state */
#define PMU_CS1_SRAM3PS_SLEEP         BIT(13)                               /*!< SRAM3 is in sleep state */
#define PMU_CS1_SRAM3PS_ACTIVE        BIT(14)                               /*!< SRAM3 is in active state */
#define PMU_CS1_BLEPS_SLEEP           BIT(16)                               /*!< BLE is in sleep state */
#define PMU_CS1_BLEPS_ACTIVE          BIT(17)                               /*!< BLE is in active state */

/* PMU_PAR0 */
#define PMU_PAR0_TWK_WL               BITS(8,15)                            /*!< Wakeup time of WIFI_OFF domain */
#define PMU_PAR0_TSW_IRCCNT           BITS(16,20)                           /*!< when enter deep-sleep, switch to IRC16M clock. Wait the IRC16M COUNTER */
#define PMU_PAR0_TWKEN                BIT(31)                               /*!< use software value when wake up WIFI_OFF or not */

/* PMU_PAR1 */
#define PMU_PAR1_TWK_SRAM1            BITS(0,7)                             /*!< wakeup time of SRAM1 domain */
#define PMU_PAR1_TWK_SRAM2            BITS(8,15)                            /*!< wakeup time of SRAM2 domain */
#define PMU_PAR1_TWK_SRAM3            BITS(16,23)                           /*!< wakeup time of SRAM3 domain */
#define PMU_PAR1_TWKSRAM1EN           BIT(29)                               /*!< use software value when wake up SRAM1 or not */
#define PMU_PAR1_TWKSRAM2EN           BIT(30)                               /*!< use software value when wake up SRAM2 or not */
#define PMU_PAR1_TWKSRAM3EN           BIT(31)                               /*!< use software value when wake up SRAM3 or not */

/* PMU_PAR2 */
#define PMU_PAR2_TWK_SRAM0            BITS(0,7)                             /*!< wakeup time of SRAM0 domain */
#define PMU_PAR2_TWK_BLE              BITS(8,15)                            /*!< wakeup time of BLE domain */
#define PMU_PAR2_TWKSRAM0EN           BIT(30)                               /*!< use software value when wake up SRAM0 or not */
#define PMU_PAR2_TWKBLEEN             BIT(31)                               /*!< use software value when wake up BLE or not */

/* PMU_RFCTL */
#define PMU_RFCTL_RFSWEN              BIT(0)                                /*!< RF software sequence enable */
#define PMU_RFCTL_RFFS                BIT(1)                                /*!< software force start, open RF power */
#define PMU_RFCTL_RFFC                BIT(2)                                /*!< software force close, close RF power */
#define PMU_RFCTL_MCU_PLLUP           BIT(3)                                /*!< software force open, open MCU PLL power */
#define PMU_RFCTL_MCU_PLLDOWN         BIT(4)                                /*!< software force close, close MCU PLL power */
#define PMU_RFCTL_BLESWEN             BIT(5)                                /*!< BLE software sequence enable */
#define PMU_RFCTL_RF_STATE            BITS(16,19)                           /*!< RF state */
#define PMU_RFCTL_MCU_STATE           BITS(20,22)                           /*!< MCU state */

/* PMU_RFPAR */
#define PMU_RFPAR_TIM1_PAR            BITS(0,6)                             /*!< RF timing parameter 1 */
#define PMU_RFPAR_TIM2_PAR            BITS(8,11)                            /*!< RF timing parameter 2 */
#define PMU_RFPAR_TIM3_PAR            BITS(16,17)                           /*!< RF timing parameter 3 */
#define PMU_RFPAR_TIM4_PAR            BITS(18,19)                           /*!< RF timing parameter 4 */
#define PMU_RFPAR_TIM5_PAR            BITS(20,21)                           /*!< RF timing parameter 5 */
#define PMU_RFPAR_TIM89_PAR           BITS(24,27)                           /*!< RF timing parameter 89 */
#define PMU_RFPAR_TIM7_PAR            BITS(28,30)                           /*!< RF timing parameter 7 */

/* PMU_INTF */
#define PMU_INTF_BLE_PS_FALLF         BIT(0)                                /*!< BLE power status falling edge interrupt flag */
#define PMU_INTF_BLE_PS_RISEF         BIT(1)                                /*!< BLE power status rising edge interrupt flag */

/* PMU_INTEN */
#define PMU_INTEN_BLE_PS_FALL_EN      BIT(0)                                /*!< BLE power status falling edge interrupt enable */
#define PMU_INTEN_BLE_PS_RISE_EN      BIT(1)                                /*!< BLE power status rising edge interrupt enable */

/* PMU_INTC */
#define PMU_INTC_BLE_PS_FALLFC        BIT(0)                                /*!< clear BLE power status falling edge interrupt flag */
#define PMU_INTC_BLE_PS_RISEFC        BIT(1)                                /*!< clear BLE power status rising edge interrupt flag */

/* constants definitions */
/* PMU LDO definitions */
#define PMU_LDO_NORMAL                ((uint32_t)0x00000000U)               /*!< LDO normal work when PMU enter deepsleep mode */
#define PMU_LDO_LOWPOWER              PMU_CTL0_LDOLP                        /*!< LDO work at low power status when PMU enter deepsleep mode */

/* PMU low voltage detector threshold definitions */
#define CTL0_LVDT(regval)             (BITS(5,7)&((uint32_t)(regval)<<5))
#define PMU_LVDT_0                    CTL0_LVDT(0)                          /*!< voltage threshold is 2.1V */
#define PMU_LVDT_1                    CTL0_LVDT(1)                          /*!< voltage threshold is 2.3V */
#define PMU_LVDT_2                    CTL0_LVDT(2)                          /*!< voltage threshold is 2.4V */
#define PMU_LVDT_3                    CTL0_LVDT(3)                          /*!< voltage threshold is 2.6V */
#define PMU_LVDT_4                    CTL0_LVDT(4)                          /*!< voltage threshold is 2.7V */
#define PMU_LVDT_5                    CTL0_LVDT(5)                          /*!< voltage threshold is 2.9V */
#define PMU_LVDT_6                    CTL0_LVDT(6)                          /*!< voltage threshold is 3.0V */
#define PMU_LVDT_7                    CTL0_LVDT(7)                          /*!< voltage threshold is 3.1V */

/* PMU low-driver mode when use low power LDO */
#define CTL0_LDLP(regval)             (BIT(10)&((uint32_t)(regval)<<10))
#define PMU_NORMALDR_LOWPWR           CTL0_LDLP(0)                          /*!< normal driver when use low power LDO */
#define PMU_LOWDR_LOWPWR              CTL0_LDLP(1)                          /*!< low-driver mode enabled when LDEN is 11 and use low power LDO */

/* PMU low-driver mode when use normal power LDO */
#define CTL0_LDNP(regval)             (BIT(11)&((uint32_t)(regval)<<11))
#define PMU_NORMALDR_NORMALPWR        CTL0_LDNP(0)                          /*!< normal driver when use normal power LDO */
#define PMU_LOWDR_NORMALPWR           CTL0_LDNP(1)                          /*!< low-driver mode enabled when LDEN is 11 and use normal power LDO */

