Nuclei-Software/nuclei-sdk/SoC/gd32vw55x/Common/Include/gd32vw55x_pmu.h
/* Low-driver mode in deep-sleep mode */
#define PMU_LOWDRIVER_DISABLE         ((uint32_t)0x00000000U)               /*!< low-driver mode disable in deep-sleep mode */
#define PMU_LOWDRIVER_ENABLE          PMU_CTL0_LDEN                         /*!< low-driver mode enable in deep-sleep mode */

/* PMU wakeup pin definitions */
#define PMU_WAKEUP_PIN0               PMU_CS0_WUPEN0                        /*!< WKUP Pin 0 (PA0) enable */
#define PMU_WAKEUP_PIN1               PMU_CS0_WUPEN1                        /*!< WKUP Pin 1 (PA15) enable */
#define PMU_WAKEUP_PIN2               PMU_CS0_WUPEN2                        /*!< WKUP Pin 2 (PA7) enable */
#define PMU_WAKEUP_PIN3               PMU_CS0_WUPEN3                        /*!< WKUP Pin 3 (PA12) enable */

/* PMU low-drive mode ready flag definitions */
#define CS0_LDRF(regval)              (BITS(18,19)&((uint32_t)(regval)<<18))
#define PMU_LDRF_NORMAL               CS0_LDRF(0)                           /*!< normal driver in deep-sleep mode */
#define PMU_LDRF_LOWDRIVER            CS0_LDRF(3)                           /*!< low-driver mode in deep-sleep mode */

/* PMU WIFI SRAM control */
#define PMU_WIFI_SLEEP                PMU_CTL1_WPSLEEP                      /*!< WIFI go to sleep */
#define PMU_WIFI_WAKE                 PMU_CTL1_WPWAKE                       /*!< wakeup WIFI */
#define PMU_SRAM1_SLEEP               PMU_CTL1_SRAM1PSLEEP                  /*!< SRAM1 go to sleep */
#define PMU_SRAM1_WAKE                PMU_CTL1_SRAM1PWAKE                   /*!< wakeup SRAM1 */
#define PMU_SRAM2_SLEEP               PMU_CTL1_SRAM2PSLEEP                  /*!< SRAM2 go to sleep */
#define PMU_SRAM2_WAKE                PMU_CTL1_SRAM2PWAKE                   /*!< wakeup SRAM2 */
#define PMU_SRAM3_SLEEP               PMU_CTL1_SRAM3PSLEEP                  /*!< SRAM3 go to sleep */
#define PMU_SRAM3_WAKE                PMU_CTL1_SRAM3PWAKE                   /*!< wakeup SRAM3 */
#define PMU_SRAM0_SLEEP               PMU_CTL1_SRAM0PSLEEP                  /*!< SRAM0 go to sleep */
#define PMU_SRAM0_WAKE                PMU_CTL1_SRAM0PWAKE                   /*!< wakeup SRAM0 */
#define PMU_BLE_SLEEP                 PMU_CTL1_BLEPSLEEP                    /*!< BLE go to sleep */
#define PMU_BLE_WAKE                  PMU_CTL1_BLEPWAKE                     /*!< wakeup BLE */

/* BLE RF sequence definitions */
#define PMU_BLE_RF_HARDWARE           ((uint32_t)0x00000000U)               /*!< enable RF by BLE hardware */
#define PMU_BLE_RF_SOFTWARE           PMU_RFCTL_BLESWEN                     /*!< enable RF by software */

/* RF sequence definitions */
#define PMU_RF_HARDWARE               ((uint32_t)0x00000000U)               /*!< enable RF hardware sequence */
#define PMU_RF_SOFTWARE               PMU_RFCTL_RFSWEN                      /*!< enable RF software sequence */

/* RF force definitions */
#define PMU_RF_FORCE_OPEN             PMU_RFCTL_RFFS                        /*!< software force start, open RF power */
#define PMU_RF_FORCE_CLOSE            PMU_RFCTL_RFFC                        /*!< software force close, close RF power */

/* MCU PLL force definitions */
#define PMU_PLL_FORCE_OPEN            PMU_RFCTL_MCU_PLLUP                   /*!< software force start, open MCU PLL power */
#define PMU_PLL_FORCE_CLOSE           PMU_RFCTL_MCU_PLLDOWN                 /*!< software force close, close MCU PLL power */

/* PMU flag definitions */
#define PMU_FLAG_WAKEUP               PMU_CS0_WUF                           /*!< wakeup flag status */
#define PMU_FLAG_STANDBY              PMU_CS0_STBF                          /*!< standby flag status */
#define PMU_FLAG_LVD                  PMU_CS0_LVDF                          /*!< LVD flag status */
#define PMU_FLAG_LDOVSRF              PMU_CS0_LDOVSRF                       /*!< LDO voltage select ready flag */
#define PMU_FLAG_LDRF                 PMU_CS0_LDRF                          /*!< low-driver mode ready flag */
#define PMU_FLAG_WIFI_SLEEP           (BIT(31) | PMU_CS1_WPS_SLEEP)      /*!< WIFI is in sleep state */
#define PMU_FLAG_WIFI_ACTIVE          (BIT(31) | PMU_CS1_WPS_ACTIVE)     /*!< WIFI is in active state */
#define PMU_FLAG_BLE_POWER            (BIT(31) | PMU_CS1_BLE_POWER_STATUS)  /*!< BLE power status */
#define PMU_FLAG_SRAM1_SLEEP          (BIT(31) | PMU_CS1_SRAM1PS_SLEEP)     /*!< SRAM1 is in sleep state */
#define PMU_FLAG_SRAM1_ACTIVE         (BIT(31) | PMU_CS1_SRAM1PS_ACTIVE)    /*!< SRAM1 is in active state */
#define PMU_FLAG_SRAM0_SLEEP          (BIT(31) | PMU_CS1_SRAM0PS_SLEEP)     /*!< SRAM0 is in sleep state */
#define PMU_FLAG_SRAM0_ACTIVE         (BIT(31) | PMU_CS1_SRAM0PS_ACTIVE)    /*!< SRAM0 is in active state */
#define PMU_FLAG_SRAM2_SLEEP          (BIT(31) | PMU_CS1_SRAM2PS_SLEEP)     /*!< SRAM2 is in sleep state */
#define PMU_FLAG_SRAM2_ACTIVE         (BIT(31) | PMU_CS1_SRAM2PS_ACTIVE)    /*!< SRAM2 is in active state */
#define PMU_FLAG_SRAM3_SLEEP          (BIT(31) | PMU_CS1_SRAM3PS_SLEEP)     /*!< SRAM3 is in sleep state */
#define PMU_FLAG_SRAM3_ACTIVE         (BIT(31) | PMU_CS1_SRAM3PS_ACTIVE)    /*!< SRAM3 is in active state */
#define PMU_FLAG_BLE_SLEEP            (BIT(31) | PMU_CS1_BLEPS_SLEEP)       /*!< BLE is in sleep state */
#define PMU_FLAG_BLE_ACTIVE           (BIT(31) | PMU_CS1_BLEPS_ACTIVE)      /*!< BLE is in active state */
#define PMU_FLAG_BLE_POWER_FALL       (BIT(30) | PMU_INTF_BLE_PS_FALLF)     /*!< BLE power status falling edge flag */
#define PMU_FLAG_BLE_POWER_RISE       (BIT(30) | PMU_INTF_BLE_PS_RISEF)     /*!< BLE power status rising edge flag */

/* PMU flag reset definitions */
#define PMU_FLAG_RESET_WAKEUP         PMU_CTL0_WURST                        /*!< wakeup flag reset */
#define PMU_FLAG_RESET_STANDBY        PMU_CTL0_STBRST                       /*!< standby flag reset */
#define PMU_FLAG_RESET_LDRF           PMU_CS0_LDRF                          /*!< low-driver mode ready flag reset */

/* PMU interrupt definitions */
#define PMU_INT_BLE_POWER_FALL        PMU_INTEN_BLE_PS_FALL_EN               /*!< BLE power status falling edge interrupt */
#define PMU_INT_BLE_POWER_RISE        PMU_INTEN_BLE_PS_RISE_EN               /*!< BLE power status rising edge interrupt */

/* PMU interrupt flag definitions */
#define PMU_INT_FLAG_BLE_POWER_FALL   PMU_INTF_BLE_PS_FALLF                 /*!< BLE power status falling edge interrupt flag */
#define PMU_INT_FLAG_BLE_POWER_RISE   PMU_INTF_BLE_PS_RISEF                 /*!< BLE power status rising edge interrupt flag */

/* PMU interrupt flag reset definitions */
#define PMU_INT_FLAG_RESET_BLE_POWER_FALL      PMU_INTC_BLE_PS_FALLFC        /*!< BLE power status falling edge interrupt flag reset */
#define PMU_INT_FLAG_RESET_BLE_POWER_RISE      PMU_INTC_BLE_PS_RISEFC        /*!< BLE power status rising edge interrupt flag reset */

