Nuclei-Software/nuclei-sdk/SoC/gd32vw55x/Common/Include/gd32vw55x_pmu.h
/* PMU command constants definitions */
#define WFI_CMD                       ((uint8_t)0x00U)                      /*!< use WFI command */
#define WFE_CMD                       ((uint8_t)0x01U)                      /*!< use WFE command */

/* function declarations */
/* reset PMU register */
void pmu_deinit(void);

/* LVD functions */
/* select low voltage detector threshold */
void pmu_lvd_select(uint32_t lvdt_n);
/* enable PMU LVD */
void pmu_lvd_enable(void);
/* disable PMU LVD */
void pmu_lvd_disable(void);

/* enable write access to the registers in backup domain */
void pmu_backup_write_enable(void);
/* disable write access to the registers in backup domain */
void pmu_backup_write_disable(void);

/* set PMU mode */
/* PMU work in sleep mode */
void pmu_to_sleepmode(uint8_t sleepmodecmd);
/* PMU work in deep-sleep mode */
void pmu_to_deepsleepmode(uint32_t ldo, uint32_t lowdrive, uint8_t deepsleepmodecmd);
/* PMU work in standby mode */
void pmu_to_standbymode(uint8_t standbymodecmd);
/* enable wakeup pin */
void pmu_wakeup_pin_enable(uint32_t wakeup_pin);
/* disable wakeup pin */
void pmu_wakeup_pin_disable(uint32_t wakeup_pin);

/* WIFI & BLE & SRAM functions */
/* enable WIFI power */
void pmu_wifi_power_enable(void);
/* disable WIFI power */
void pmu_wifi_power_disable(void);
/* WIFI & SRAM low power control */
void pmu_wifi_sram_control(uint32_t wifi_sram);
/* BLE low power control */
void pmu_ble_control(uint32_t ble);
/* enable BLE wakeup request */
void pmu_ble_wakeup_request_enable(void);
/* disable BLE wakeup request */
void pmu_ble_wakeup_request_disable(void);

/* MCU PLL power functions */
/* enable MCU PLL power force open/close */
void pmu_pll_force_enable(uint32_t force);
/* disable MCU PLL power open/close force */
void pmu_pll_force_disable(uint32_t force);

/* RF functions */
/* configure BLE RF sequence */
void pmu_ble_rf_config(uint32_t mode);
/* enable RF sequence force open/close */
void pmu_rf_force_enable(uint32_t force);
/* disable RF sequence open/close force */
void pmu_rf_force_disable(uint32_t force);
/* configure RF sequence */
void pmu_rf_sequence_config(uint32_t mode);

/* interrupt and flag functions */
/* get flag status */
FlagStatus pmu_flag_get(uint32_t flag);
/* clear flag bit */
void pmu_flag_clear(uint32_t flag);
/* enable PMU interrupt */
void pmu_interrupt_enable(uint32_t interrupt);
/* disable PMU interrupt */
void pmu_interrupt_disable(uint32_t interrupt);
/* get PMU interrupt flag */
FlagStatus pmu_interrupt_flag_get(uint32_t int_flag);
/* clear PMU interrupt flag */
void pmu_interrupt_flag_clear(uint32_t int_flag);

#endif /* GD32VW55X_PMU_H */
